app/views/boards/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."board_id" = ?  [["board_id", 1]]
---
<% if @like.count > 0%>
<button type="button" class="btn btn-warning" id="like-button"><i style="font-size:1em;" class="fas fa-moon"></i> (<span id="like-count"><%= @board.likes.count%></span>)</button>

SELECT "comments".* FROM "comments" WHERE "comments"."board_id" = ?  [["board_id", 1]]
---
  <tbody class="comment-list">
    <% @board.comments.reverse.each do |comment| %>