app/controllers/boards_controller.rb

INSERT INTO "boards" ("title", "contents", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "하이 헬로우"], ["contents", "하이 예에"], ["user_id", 1], ["created_at", "2017-12-27 05:13:18.023751"], ["updated_at", "2017-12-27 05:13:18.023751"]]
---
  def create
    board = Board.create(
      title: params[:title],
      contents: params[:contents],
      user_id: current_user.id
    )

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @board = Board.find(params[:id])

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."board_id" = ?  ORDER BY "likes"."id" ASC LIMIT 1  [["user_id", 1], ["board_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."board_id" = ?  [["user_id", 1], ["board_id", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
INSERT INTO "likes" ("user_id", "board_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["board_id", 1], ["created_at", "2017-12-28 05:26:11.732948"], ["updated_at", "2017-12-28 05:26:11.732948"]]
---
  def like_board
    #find는 하나만 리턴, where는 이 조건에 해당하는 모든 케이스를 반환
    user_like = Like.where(user_id: current_user.id, board_id: params[:id])
    if user_like.count > 0
      user_like.first.destroy
    else
      Like.create( user_id: current_user.id, board_id: params[:id])

INSERT INTO "comments" ("user_id", "board_id", "contents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["board_id", 1], ["contents", "asdasdasd"], ["created_at", "2017-12-28 06:45:09.302168"], ["updated_at", "2017-12-28 06:45:09.302168"]]
---
  def create_comment
    @comment = Comment.create(
      user_id: current_user.id,
      board_id: params[:id],
      contents: params[:contents]
    )

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 10]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 10]]
---
  def delete_comment
    Comment.find(params[:id]).destroy()